In [24]:
#pd.read_csv(path)
#pd.read_excel(path)
import pandas as pd
import numpy as np

In [25]:
import pandas as pd
import numpy as np
df=pd.read_csv('Titanic.csv')
df.shape
df.size
df.dtypes
df.ndim
df.columns
df.head()
df.tail()
df.info()
df.describe()
df.describe(percentiles=[0.01,0.05,0.99])
np.percentile(df.Fare,[25,75,99])
df.Fare.quantile([0.25,0.75,0.99])
print(dir(pd))
df.nunique()
df.Survived.unique()
df.Age.unique()
for i in df.columns:
    if df[i].nunique() < 10:
        print(i,df[i].unique())
        print('----------------')
        
df.Sex.value_counts()
df.Pclass.value_counts()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_is_numpy_dev', '_libs', '_testing', '_typing', '_version', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']
Survived [0 1]
----------------
Pclass [3 1 2]
----------------
Sex ['male' 'female']
----------------
SibSp [1 0 3 4 2 5 8]
----------------
Parch [0 1 2 5 3 4 6]
----------------
Embarked ['S' 'C' 'Q' nan]
----------------

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [26]:
df.isna().sum()
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [27]:
df.Age.mean()

29.69911764705882

In [28]:
df.Age.fillna(df.Age.mean())

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [29]:
df.Age.fillna(df.Age.mean(), inplace= True)

In [30]:
df.Age.isna().sum()

0

In [31]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,13.002015,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,22.000000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,29.699118,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,35.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [32]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [33]:
df.dropna(inplace=True)

In [34]:
df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [35]:
df.dropna(thresh=2)
#escape all rows that have atleast two non null value

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [36]:
df.drop('Survived', axis=1,inplace= True)

In [37]:
((df.isna().sum())/len(df))*100

PassengerId    0.0
Pclass         0.0
Name           0.0
Sex            0.0
Age            0.0
SibSp          0.0
Parch          0.0
Ticket         0.0
Fare           0.0
Cabin          0.0
Embarked       0.0
dtype: float64

In [38]:
df.drop('Cabin', axis=1, inplace = True)

In [39]:
df.drop(['PassengerId','SibSp','Parch'], axis = 1, inplace = True)

In [40]:
df

,Pclass,Name,Sex,Age,Ticket,Fare,Embarked
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,S
6,1,"McCarthy, Mr. Timothy J",male,54.0,17463,51.8625,S
10,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,PP 9549,16.7000,S
11,1,"Bonnell, Miss. Elizabeth",female,58.0,113783,26.5500,S
...,...,...,...,...,...,...,...
871,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,11751,52.5542,S
872,1,"Carlsson, Mr. Frans Olof",male,33.0,695,5.0000,S
879,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,11767,83.1583,C
887,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,S
889,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C

In [41]:
lst=[i for i in range(1,14)]
s=pd.Series(lst)
s

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
dtype: int64

In [42]:
print(type(s))

<class 'pandas.core.series.Series'>

In [43]:
s.shape

(13,)

In [44]:
name=['Mayank','Geetika','Rishabh','Deepak']
emp=pd.Series(name)
emp

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
dtype: object

In [45]:
emp.size

4

In [46]:
s.size

13

In [47]:
s.dtype

dtype('int64')

In [48]:
emp.dtype

dtype('O')

In [49]:
s.ndim

1

In [50]:
emp.ndim

1

In [41]:
s.shape
emp.shape

(4,)

In [42]:
s.index

RangeIndex(start=0, stop=13, step=1)

In [43]:
emp.index

RangeIndex(start=0, stop=4, step=1)

In [44]:
s.values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13], dtype=int64)

In [45]:
emp.values

array(['Mayank', 'Geetika', 'Rishabh', 'Deepak'], dtype=object)

In [46]:
emp.name='Employee_names'

In [47]:
emp

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
Name: Employee_names, dtype: object

In [49]:
info={'id':101,'Name':'Mayank','Age':29,'City':'Surat'}
info

{'id': 101, 'Name': 'Mayank', 'Age': 29, 'City': 'Surat'}

In [50]:
type(info)

dict

In [51]:
info_ser=pd.Series(info)
info_ser

id         101
Name    Mayank
Age         29
City     Surat
dtype: object

In [52]:
name

['Mayank', 'Geetika', 'Rishabh', 'Deepak']

In [53]:
s=pd.Series(name)
s

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
dtype: object

In [56]:
s=pd.Series(name,index=list('xxxx'))

In [57]:
s

x     Mayank
x    Geetika
x    Rishabh
x     Deepak
dtype: object

In [58]:
s.index

Index(['x', 'x', 'x', 'x'], dtype='object')

In [59]:
c1=['a1','a2','a3']
c2=[1,2,3]
cc=pd.Series(c1,index=c2)
cc

1    a1
2    a2
3    a3
dtype: object

In [60]:
cc.iloc[1]

'a2'

In [61]:
cc.loc[1]

'a1'

In [62]:
cc.iloc['a1']

TypeError: Cannot index by location index with a non-integer key

In [63]:
cc

1    a1
2    a2
3    a3
dtype: object

In [64]:
cc.iloc[::-1]

3    a3
2    a2
1    a1
dtype: object

In [65]:
cc.loc[::-1]

3    a3
2    a2
1    a1
dtype: object

In [67]:
np.random.seed(10)
arr=np.random.randint(10,100,12)
arr

array([19, 25, 74, 38, 99, 39, 18, 83, 10, 50, 46, 26])

In [82]:
ae=np.random.randint(1,5,7)
ae

array([1, 1, 3, 3, 3, 1, 3])

In [71]:
ae.dtype

dtype('int32')

In [83]:
num=pd.Series(ae)
ae

array([1, 1, 3, 3, 3, 1, 3])

In [84]:
num

0    1
1    1
2    3
3    3
4    3
5    1
6    3
dtype: int32

In [85]:
num.sum()

15

In [86]:
num.mean()

2.142857142857143

In [87]:
num.median()

3.0

In [88]:
num.var()

1.1428571428571428

In [89]:
num

0    1
1    1
2    3
3    3
4    3
5    1
6    3
dtype: int32

In [94]:
a=np.random.randint(1,5,3)
a

array([3, 2, 3])

In [105]:
a=[8,22,61]
ar1=pd.Series(a)
ar1

0     8
1    22
2    61
dtype: int64

In [106]:
ar1.mean()

30.333333333333332

In [98]:
a=((2-2.66)*2)/2
a

-0.6600000000000001

In [107]:
ar1.var()

754.3333333333334

In [108]:
ar1.std()

27.465129406819358

In [109]:
(arr.var())**(1/2)

26.90866754205583

In [111]:
a=2*3
b=2**(1/2)

b

1.4142135623730951

In [112]:
ar1.max()

61

In [113]:
ar1.min()

8

In [115]:
x=np.random.randint(0,34,6)
x

array([29, 11, 22, 11, 21, 33])

In [116]:
y=pd.Series(x)
y

0    29
1    11
2    22
3    11
4    21
5    33
dtype: int32

In [118]:
y.min()

11

In [120]:
y.sort_values(ignore_index = True)

0    11
1    11
2    21
3    22
4    29
5    33
dtype: int32

In [121]:
y.sort_values(ignore_index= True, ascending = False)

0    33
1    29
2    22
3    21
4    11
5    11
dtype: int32

In [21]:
name=['mayank','rishabh','geetika','deepak','priya']
ID=[101,102,103,104,105]
city = ['rajkot','surat','baroda','vapi','pune']
lst=[name,ID,city]

In [22]:
df=pd.DataFrame(lst)
df

NameError: name 'pd' is not defined

In [23]:
df=pd.DataFrame(lst).T
df

NameError: name 'pd' is not defined

In [134]:
df.columns=['Name','ID','City']

In [135]:
df

      Name   ID    City
0   mayank  101  rajkot
1  rishabh  102   surat
2  geetika  103  baroda
3   deepak  104    vapi
4    priya  105    pune

In [52]:
lst=(('kajal',1,'rajkot'),('priya',2,'vapi'),('dipak',3,'surat'))
lst

(('kajal', 1, 'rajkot'), ('priya', 2, 'vapi'), ('dipak', 3, 'surat'))

In [53]:
type(lst)

tuple

In [54]:

lst1=pd.DataFrame(lst,columns=['name','ID','City'])
lst1

    name  ID    City
0  kajal   1  rajkot
1  priya   2    vapi
2  dipak   3   surat

In [55]:
type(lst1)

pandas.core.frame.DataFrame

In [56]:
s=pd.Series(name)

In [57]:
s

0     Mayank
1    Geetika
2    Rishabh
3     Deepak
dtype: object

In [58]:
lst1.shape

(3, 3)

In [59]:
lst1.size

9

In [60]:
lst1

    name  ID    City
0  kajal   1  rajkot
1  priya   2    vapi
2  dipak   3   surat

In [61]:
lst1.ndim

2

In [62]:
lst1.index

RangeIndex(start=0, stop=3, step=1)

In [63]:
lst1.values

array([['kajal', 1, 'rajkot'],
       ['priya', 2, 'vapi'],
       ['dipak', 3, 'surat']], dtype=object)

In [64]:
lst1.columns

Index(['name', 'ID', 'City'], dtype='object')

In [65]:
lst1.iloc[0]

name     kajal
ID           1
City    rajkot
Name: 0, dtype: object

In [66]:
lst1.loc[0]

name     kajal
ID           1
City    rajkot
Name: 0, dtype: object

In [67]:
lst1.index=lst1.ID

In [68]:
lst1

     name  ID    City
ID
1   kajal   1  rajkot
2   priya   2    vapi
3   dipak   3   surat

In [69]:
lst1.loc[1]

name     kajal
ID           1
City    rajkot
Name: 1, dtype: object

In [70]:
lst1.iloc[1]

name    priya
ID          2
City     vapi
Name: 2, dtype: object

In [71]:
lst1.iloc[len(lst1)-1]

name    dipak
ID          3
City    surat
Name: 3, dtype: object

In [72]:
lst1

     name  ID    City
ID
1   kajal   1  rajkot
2   priya   2    vapi
3   dipak   3   surat

In [73]:
lst1.iloc[0:2]

     name  ID    City
ID
1   kajal   1  rajkot
2   priya   2    vapi

In [74]:
lst1.loc[2:3]

     name  ID   City
ID
2   priya   2   vapi
3   dipak   3  surat

In [75]:
lst1.iloc[0:2,0:2]

     name  ID
ID
1   kajal   1
2   priya   2

In [76]:
lst1.iloc[::-1]

     name  ID    City
ID
3   dipak   3   surat
2   priya   2    vapi
1   kajal   1  rajkot

In [77]:
lst1.iloc[::1,1:1:1]

Empty DataFrame
Columns: []
Index: [1, 2, 3]

In [78]:
lst1['name']

ID
1    kajal
2    priya
3    dipak
Name: name, dtype: object

In [79]:
type(lst1[['name']])

pandas.core.frame.DataFrame

In [81]:
df

,Pclass,Name,Sex,Age,Ticket,Fare,Embarked
1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C
3,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,113803,53.1000,S
6,1,"McCarthy, Mr. Timothy J",male,54.0,17463,51.8625,S
10,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,PP 9549,16.7000,S
11,1,"Bonnell, Miss. Elizabeth",female,58.0,113783,26.5500,S
...,...,...,...,...,...,...,...
871,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,11751,52.5542,S
872,1,"Carlsson, Mr. Frans Olof",male,33.0,695,5.0000,S
879,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,11767,83.1583,C
887,1,"Graham, Miss. Margaret Edith",female,19.0,112053,30.0000,S
889,1,"Behr, Mr. Karl Howell",male,26.0,111369,30.0000,C

In [83]:
df.index = [f'emp{i}' for i in range(1,7)]

ValueError: Length mismatch: Expected axis has 202 elements, new values have 6 elements

In [84]:
import numpy as np

In [85]:
arr = np.array([2.6,7.5,6,7,8,62,45])

In [86]:
arr.dtype

dtype('float64')

In [87]:
arr.astype(int)

array([ 2,  7,  6,  7,  8, 62, 45])

In [88]:
a= None
print(type(a))

<class 'NoneType'>

In [89]:
x=np.array([np.nan])
x.dtype

dtype('float64')

In [90]:
arr=np.array([10,20,np.nan,50,60,70])
arr

array([10., 20., nan, 50., 60., 70.])

In [91]:
arr.dtype

dtype('float64')

In [93]:
np.isnan(arr)

array([False, False,  True, False, False, False])

In [95]:
np.isnan(arr).sum()

1

In [96]:
(~np.isnan(arr)).sum()

5

In [97]:
np.isnan(arr[0])

False

In [98]:
np.where(np.isnan(arr))

(array([2], dtype=int64),)

In [99]:
arr[2]

nan

In [100]:
arr=np.random.randint(10,100,12).reshape(3,4)

In [101]:
arr

array([[62, 15, 75, 15],
       [21, 99, 85, 87],
       [22, 90, 49, 95]])

In [102]:
np.where(arr>50)

(array([0, 0, 1, 1, 1, 2, 2], dtype=int64),
 array([0, 2, 1, 2, 3, 1, 3], dtype=int64))

In [110]:
arr=np.array([10,20,30,np.nan,60,np.nan,9,np.nan]).reshape(2,4)
arr
np.where(np.isnan(arr))

(array([0, 1, 1], dtype=int64), array([3, 1, 3], dtype=int64))

In [111]:
arr

array([[10., 20., 30., nan],
       [60., nan,  9., nan]])

In [112]:
arr[np.where(np.isnan(arr))]

array([nan, nan, nan])

In [113]:
arr[np.isnan(arr)==True]

array([nan, nan, nan])

In [114]:
arr[np.isnan(arr)==False]

array([10., 20., 30., 60.,  9.])

In [115]:
arr[~np.isnan(arr)]

array([10., 20., 30., 60.,  9.])

In [116]:
arr[np.where(~np.isnan(arr))]

array([10., 20., 30., 60.,  9.])

In [119]:
arr[np.where(np.isnan(arr))]

array([], dtype=float64)

In [118]:
arr[np.isnan(arr)] = 0

In [120]:
arr

array([[10., 20., 30.,  0.],
       [60.,  0.,  9.,  0.]])

In [121]:
arr[np.where(arr==0)]=10

In [140]:
arr
arr=arr.astype('str')

In [141]:
arr[np.where(arr=='10.0')]='Kajal'

In [142]:
arr

array([['Kajal', '20.0', '30.0', 'Kajal'],
       ['60.0', 'Kajal', '9.0', 'Kajal']], dtype='<U32')